Tekla.Structures.ModelInternal.CheckResult
The CheckResult class contains information about the current check result.

Tekla.Structures.ModelInternal.CheckResult.Guid
The part guid.

Tekla.Structures.ModelInternal.CheckResult.AbmStatus
The part abm status.

Tekla.Structures.ModelInternal.CheckResult.AbmMark
The abm mark.

Tekla.Structures.ModelInternal.CheckResult.SubmittalNumber
The submittal number.

Tekla.Structures.ModelInternal.CheckResult.PreliminaryAbmMark
The preliminary ABM mark.

Tekla.Structures.ModelInternal.CheckResult.Length
The net length.

Tekla.Structures.ModelInternal.CheckResult.OldLength
The net length change.

Tekla.Structures.ModelInternal.CheckResult.Profile
The profile.

Tekla.Structures.ModelInternal.CheckResult.OldProfile
The old profile.

Tekla.Structures.ModelInternal.CheckResult.Material
The material.

Tekla.Structures.ModelInternal.CheckResult.OldMaterial
The old material.

Tekla.Structures.ModelInternal.CheckResult.Width
The width.

Tekla.Structures.ModelInternal.CheckResult.ToStruct(Tekla.Structures.ModelInternal.dotCheckABMResult_t@)
Copy CheckResult to dotCheckABMResult_t.
Info: The check result info.

Tekla.Structures.ModelInternal.CheckResult.FromStruct(Tekla.Structures.ModelInternal.dotCheckABMResult_t)
Copy dotCheckABMResult_t to CheckResult.
Info: The check result info.